tickets/tests/data/stripe_charge_success.json

{
    "amount": 9000,
    "amount_refunded": 0,
    "application": null,
    "application_fee": null,
    "balance_transaction": "txn_abcdefghijklmnopqurstuvw",
    "captured": true,
    "created": 1495355163,
    "currency": "gbp",
    "customer": null,
    "description": "PyCon UK 2018 order DF55",
    "destination": null,
    "dispute": null,
    "failure_code": null,
    "failure_message": null,
    "fraud_details": {},
    "id": "ch_abcdefghijklmnopqurstuvw",
    "invoice": null,
    "livemode": false,
    "metadata": {},
    "object": "charge",
    "on_behalf_of": null,
    "order": null,
    "outcome": {
        "network_status": "approved_by_network",
        "reason": null,
        "seller_message": "Payment complete.",
        "type": "authorized"
    },
    "paid": true,
    "receipt_email": null,
    "receipt_number": null,
    "refunded": false,
    "refunds": {
        "data": [],
        "has_more": false,
        "object": "list",
        "total_count": 0,
        "url": "/v1/charges/ch_abcdefghijklmnopqurstuvw/refunds"
    },
    "review": null,
    "shipping": null,
    "source": {
        "address_city": null,
        "address_country": null,
        "address_line1": null,
        "address_line1_check": null,
        "address_line2": null,
        "address_state": null,
        "address_zip": "AB1 9YZ",
        "address_zip_check": "pass",
        "brand": "Visa",
        "country": "US",
        "customer": null,
        "cvc_check": "pass",
        "dynamic_last4": null,
        "exp_month": 10,
        "exp_year": 2020,
        "fingerprint": "5hdVznYB9mMrgoFZ",
        "funding": "credit",
        "id": "card_abcdefghijklmnopqurstuvw",
        "last4": "4242",
        "metadata": {},
        "name": "alice@example.com",
        "object": "card",
        "tokenization_method": null
    },
    "source_transfer": null,
    "statement_descriptor": null,
    "status": "succeeded",
    "transfer_group": null
}
